[
    {
      "id": 1,
      "name": "iPhone 16",
      "description": "Experience the future with the iPhone 16. Featuring an advanced A18 chip, improved camera system, and all-day battery life. Available in stunning new colors.",
      "price": 899.99,
      "image": "/images/iphone16.webp"
    },
    {
      "id": 2,
      "name": "iPhone 16 Plus",
      "description": "Enjoy a larger display with the iPhone 16 Plus. Powered by the A18 chip, it offers enhanced performance and an impressive camera system for capturing life's moments.",
      "price": 999.99,
      "image": "/images/iphone16plus.webp"
    },
    {
      "id": 3,
      "name": "iPhone 16 Pro",
      "description": "For professionals and enthusiasts, the iPhone 16 Pro delivers cutting-edge technology. ProMotion display, pro-grade cameras, and the powerful A18 Pro chip.",
      "price": 1099.99,
      "image": "/images/iphone16pro.webp"
    },
    {
      "id": 4,
      "name": "iPhone 16 Pro Max",
      "description": "The ultimate iPhone experience. Largest display, most advanced camera system, and the A18 Pro chip for unparalleled performance.",
      "price": 1199.99,
      "image": "/images/iphone16promax.webp"
    },
    {
      "id": 5,
      "name": "iPhone 15",
      "description": "Sleek design meets powerful performance. The iPhone 15 features an improved camera, faster A17 chip, and 5G capabilities.",
      "price": 799.99,
      "image": "/images/iphone15.webp"
    },
    {
      "id": 6,
      "name": "iPhone 15 Plus",
      "description": "Bigger is better with the iPhone 15 Plus. Enjoy a larger display, long-lasting battery, and advanced dual-camera system.",
      "price": 899.99,
      "image": "/images/iphone15plus.webp"
    },
    {
      "id": 7,
      "name": "iPhone 15 Pro",
      "description": "Professional-grade camera and performance. The iPhone 15 Pro features a ProMotion display, A17 Pro chip, and a versatile triple-lens camera system.",
      "price": 999.99,
      "image": "/images/iphone15pro.webp"
    },
    {
      "id": 8,
      "name": "iPhone 15 Pro Max",
      "description": "The most powerful iPhone 15. Largest display, advanced camera capabilities, and the A17 Pro chip for unmatched performance.",
      "price": 1099.99,
      "image": "/images/iphone15promax.webp"
    },
    {
      "id": 9,
      "name": "iPhone 14",
      "description": "Reliable performance and great features. The iPhone 14 offers an excellent camera, A16 chip, and all-day battery life at a great value.",
      "price": 699.99,
      "image": "/images/iphone14.webp"
    },
    {
      "id": 10,
      "name": "iPhone 14 Pro",
      "description": "Pro performance for less. Experience the Dynamic Island, always-on display, and pro-level cameras of the iPhone 14 Pro.",
      "price": 899.99,
      "image": "/images/iphone14pro.webp"
    },
    {
      "id": 11,
      "name": "Apple Watch Series 10",
      "description": "The most advanced Apple Watch yet. Featuring health sensors, fitness tracking, and seamless integration with your iPhone.",
      "price": 499.99,
      "image": "/images/series10.webp"
    },
    {
      "id": 12,
      "name": "Apple Watch Series 9",
      "description": "Stay connected and healthy. The Apple Watch Series 9 offers ECG, blood oxygen monitoring, and a range of fitness features.",
      "price": 399.99,
      "image": "/images/series9.webp"
    },
    {
      "id": 13,
      "name": "Apple Watch SE",
      "description": "Essential features at a great value. Track your fitness, stay connected, and monitor your health with the affordable Apple Watch SE.",
      "price": 279.99,
      "image": "/images/se.webp"
    },
    {
      "id": 14,
      "name": "AirPods 2nd Gen",
      "description": "Effortless wireless audio. Enjoy easy setup, clear sound, and long battery life with the 2nd generation AirPods.",
      "price": 129.99,
      "image": "/images/airpods2ndgen.webp"
    },
    {
      "id": 15,
      "name": "AirPods Pro",
      "description": "Immersive sound experience. Active Noise Cancellation, Transparency mode, and customizable fit for premium audio.",
      "price": 249.99,
      "image": "/images/airpodspro.webp"
    },
    {
      "id": 16,
      "name": "iPhone 12 Mini Case",
      "description": "Protect your iPhone 12 Mini in style. Durable construction and precise fit for your compact iPhone.",
      "price": 39.99,
      "image": "/images/iphone12minicase.webp"
    },
    {
      "id": 17,
      "name": "iPhone 13 Mini Case",
      "description": "Sleek protection for your iPhone 13 Mini. Available in various colors to match your style.",
      "price": 39.99,
      "image": "/images/iphone13minicase.webp"
    },
    {
      "id": 18,
      "name": "iPhone 13 Case",
      "description": "Defend your iPhone 13 from drops and scratches. Slim design maintains your phone's elegant profile.",
      "price": 49.99,
      "image": "/images/iphone13case.webp"
    },
    {
      "id": 19,
      "name": "iPhone 14 Case",
      "description": "Premium protection for your iPhone 14. Precision-engineered to fit perfectly and enhance your grip.",
      "price": 49.99,
      "image": "/images/iphone14case.webp"
    },
    {
      "id": 20,
      "name": "iPhone 15 Case",
      "description": "Safeguard your iPhone 15 with our latest case. Offering robust protection without compromising on style or functionality.",
      "price": 59.99,
      "image": "/images/iphone15case.webp"
    }
  ]